# Pandas Week 4 - Joshua Lewi (2473018)

### 13. Konversi nilai numerik ke dalam kategori pada DataFrame

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [5]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), columns=cols)
df

   usia
0    67
1    58
2    68
3    20
4    47
5    23
6    72
7    86
8    13
9    45

Pengelompokan nilai numerik berupa usia menggunakan cut()

In [7]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                            bins=[0, 18, 65, 99],
                            labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    67        manula
1    58        dewasa
2    68        manula
3    20        dewasa
4    47        dewasa
5    23        dewasa
6    72        manula
7    86        manula
8    13          anak
9    45        dewasa

### 14. Merge 2 Pandas DF

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   2   7  16  18   7
1   5   3   5  16  13
2  19  13  19   4  16
3  16  11   3  14  15
4   9  17  15  15  12

In [9]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0   2   7  16  18   7
2  19  13  19   4  16
3  16  11   3  14  15

In [10]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1   5   3   5  16  13
2  19  13  19   4  16
4   9  17  15  15  12

In [ ]:
#Menggunakan Method pd.merge() inner = data yang ada di kedua df
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A   B   C  D   E
0  19  13  19  4  16

In [14]:
#Outer merge = semua data dari kedua df (yang ada duplikasinya diadopsi di salah satu aja)
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   2   7  16  18   7
1   5   3   5  16  13
2   9  17  15  15  12
3  16  11   3  14  15
4  19  13  19   4  16

### 15. Memecah nilai string suatu kolom ke dalam beberapa kolom baru di DF

In [15]:
data = {'nama': ['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'],
        'tempat_kelahiran': ['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

In [18]:
#mau misahin nama depan dan blakang (Expand = mengizinkan hasil split jadi beberapa kolom)
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [21]:
#sama untuk tempat lahir
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

### 16. Menggunakan unstack() pada multiple indexes di DF

menata ulang data framenya yang ada multiple index

In [23]:
df = pd.read_csv('https://raw.githubusercontent.com/boedybios/kaggle_explorations/refs/heads/master/belajar_matplotlib_dasar/data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [26]:
#yang mau diamati itu survivednya, dikelompokkan dalam female dan male, yang diakses hanya aggregate value dari survivednya aja, dalam bentuk rata".
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame() #frame itu buat mempercantik layoutnya.

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

In [29]:
#nah kalo ada multiple index, kita bisa atur ulang pake unstack() (biar si tulisan survivednya turun sejajar ke barisan sex dan pclass)
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130